# TagsCannotBePlacedInUnlocked3dViews Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..TagFailures..::..TagsCannotBePlacedInUnlocked3dViews Property
BuiltInFailures..::..TagFailures Class See Also
---
Tags can't be pasted into Unlocked 3D views.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId TagsCannotBePlacedInUnlocked3dViews { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TagsCannotBePlacedInUnlocked3dViews As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ TagsCannotBePlacedInUnlocked3dViews {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..TagFailures Class
Autodesk.Revit.DB Namespace